[
    {
        "title": "Your Cheatsheet to Passing a Software Engineering Technical Interview",
        "author": "Blake Potvin",
        "date": "12/08/2021",
        "description": "The short guide of passing the infamous techinical interview.",
        "body": [
            [
                "",
                "Computer science has been exponentially growing as a field as more companies have been boasting higher demands for programmers more than ever. Even with its benefits such as high salaries, amazing companies, etc. the concept is very hard to master and is bound to a niche audience who can fulfill the requirements. One of the requirements is passing the notorious software engineering technical interview. An interview in which your skills as a programmer are put to the test by solving a real-world problem in the fastest and most efficient way possible. Sounds complicated right? Add a daunting interviewer to the equation and you found the recipe to stress. But this doesn’t have to be stressful given the proper amount of practice and knowledge."
            ],
            [
                "Understanding why companies would give a technical interview",
                "To first understand how to pass your interview, look into a different lens to understand the “why” of a technical interview. Companies are looking for qualified candidates that can think programmatically towards problems faced in the position a candidate is applying for. It also proves to the interviewer that you can apply your knowledge of coding first-hand, “Like the phrase “Show, don’t tell,” you have to prove that you have the skills required to do the job, rather than just tell the interviewer that you have them” (Bradford). You could have 10 programming languages listed in your resume, but if you can’t create an algorithm to solve your problems, then you’re not going to look appealing to an interviewer as those languages would become meaningless."
            ],
            [
                "Practice, Practice, Practice!",
                "I’m not the one to sound like your dad, but practice will help in the field of programming. Don’t memorize the code to solve certain leetcode problems! You’re going to stump yourself up trying to remember where a semi-colon was than solving the problems with your brain, “Always solve the problem algorithmically first” (Ciubotariu). Instead, understand the algorithms that are required to solve leetcode problems. For example, the infamous two-sum problem uses a hash table to look at previous indexes. Also remember your constraints! Big O notation is key to understanding what would be passing in terms of computational efficiency."
            ],
            [
                "Speak your mind, but not too literally.",
                "A key strategy to utilize during the interviews is speaking what’s on your mind. This allows for your interviewer to understand the way that you think around the problem and can help them identify you as a better candidate. But don’t overdo this and say there’s no way to solve this. You want to keep that perfect character of yourself as the picture for your interviewer."
            ],
            [
                "Give it your all, you’ll get through this.",
                "Not receiving a job from a company may be heartbreaking but don’t let that be the roadblock that stops your infinitely long highway of life. Try again at the same place or even elsewhere! Every software engineer has practically been in your position so know you’re not alone. Sometimes getting denied is a good thing, it lets you know that you might not be ready for such a high stakes position. Keeping your hopes up and consistently motivating yourself is the best way to keep your mindset right within a stressful time.\nEven with a stressful environment to endure in interviews, remember it’s just one chapter in the book of your life. You also want to remember that your interviewer isn’t the devil. They’re human too! Having clear conversation with them and asking proper questions would be very enticing as a candidate and would help relieve some of your stress. In the end, just remember to give it your all and you’ll be happy knowing you did the best that you could."
            ]
        ]
    }
]